a = []
print(type(a))
# >>> <class 'list'>

b = list()
print(type(b))
# >>> <class 'list'>

с = [1, 2, 3]
print(type(с))
# >>> <class 'list'>

a = [1, 3, 5, 7]
b = a[:]
print(a)
# >>> [1, 3, 5, 7]
print(b)
# >>> [1, 3, 5, 7]

a = [1, 3, 5, 7]
b = list(a)
print(a)
# >>> [1, 3, 5, 7]
print(b)
# >>> [1, 3, 5, 7]

a = [1, 3, 5, 7]
b = a
print(a)
# >>> [1, 3, 5, 7]
print(b)
# >>> [1, 3, 5, 7]
a[1] = 10
print(a)
# >>> [1, 10, 5, 7]
print(b)
# >>> [1, 10, 5, 7]


d = [2, 4, 9]
print(d)
# >>> [2, 4, 9]

d[1] = 17
print(d)
# >>> [2, 17, 9]


a = [3, 5, 7, 10, 3, 2, 6, 0]
a[2]
# >>> 7

a[-1]
# >>> 0

a[1:4]
# >>> [5, 7, 10]



#Methods

l = [1, 2, 3, 5, 7]
l.sort()
print(l)
# [1, 2, 3, 5, 7]
l = l.sort()
print(l)
# None

a = [1, 2]
a.append(3)
print(a)
# >>> [1, 2, 3]

a = [1, 2]
b = [3, 4]
a.extend(b)
print(a)
# >>> [1, 2, 3, 4]

a = [1, 2]
a.insert(0, 5)
print(a)
# >>> [5, 1, 2]
a.insert(len(a), 9)
print(a)
# >>> [5, 1, 2, 9]

a = [1, 2, 3]
a.remove(1)
print(a)
# >>> [2, 3]


c = [3, 5, 1, 9, 6]
print(c)
# >>> [3, 5, 1, 9, 6]
del c[2]
print(c)
# >>> [3, 5, 9, 6]

a = [1, 2, 3, 4, 5]
print(a.pop(2))
# >>> 3
print(a.pop())
# >>> 5
print(a)
# >>> [1, 2, 4]

a = [1, 2, 3, 4, 5]
print(a)
# >>> [1, 2, 3, 4, 5]
a.clear()
print(a)
# >>> []

a = [1, 2, 3, 4, 5]
a.index(4)
# >>> 3

a=[1, 2, 2, 3, 3]
print(a.count(2))
# >>> 2

a = [1, 4, 2, 8, 1]
a.sort()
print(a)
# >>> [1, 1, 2, 4, 8]


a = [1, 3, 5, 7]
a.reverse()
print(a)
# >>> [7, 5, 3, 1]

a = [1, 7, 9]
b = a.copy()
print(a)
# >>> [1, 7, 9]
print(b)
# >>> [1, 7, 9]
b[0] = 8
print(a)
# >>> [1, 7, 9] # Осталось прежним
print(b)
# >>> [8, 7, 9] # Изменилось



#Слайсы

a = [i for i in range(10)]

# Получить копию списка
print(a[:])
# >>> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# Получить первые пять элементов списка
print(a[0:5])
# >>> [0, 1, 2, 3, 4]
# Получить элементы с 3-го по 7-ой
print(a[2:7])
# >>> [2, 3, 4, 5, 6]
# Взять из списка элементы с шагом 2
print(a[::2])
# >>> [0, 2, 4, 6, 8]
# Взять из списка элементы со 2-го по 8-ой с шагом 2
print(a[1:8:2])
# >>> [1, 3, 5, 7]

s = slice(0, 5, 1)
print(a[s])
# >>> [0, 1, 2, 3, 4]

s = slice(1, 8, 2)
print(a[s])
# >>> [1, 3, 5, 7]


